[
  {
    "date": "2023-03-19 13:57:33",
    "text": "⚡️**Top Russian investigator **[**wants](https://kyivindependent.com/news-feed/russian-state-media-russia-wants-legal-assessment-of-icc-arrest-warrant-for-putin)**** ‘legal assessment’ of statement on Putin's possible arrest.\n**\nAlexander Bastrykin, head of Russia's Investigative Committee, said he had ordered a legal assessment of a German minister's statement that Putin will be arrested if he comes to Germany. \n\nOn March 17, the International Criminal Court issued an arrest warrant for Putin. German Justice Minister Marco Buschmann said later that Germany would have to arrest Putin if he enters the country's territory and if the court asks contracting states for enforcement."
  },
  {
    "date": "2023-03-19 12:57:46",
    "text": "⚡️**Financial Times: Explosives shortage **[**jeopardizes](https://kyivindependent.com/news-feed/explosives-shortage-jeopardizes-e-us-effort-to-boost-shell-production-for-ukraine)**** EU's effort to boost shell production for Ukraine. **\n\nEU member states that produce ammunition for Ukraine have faced a shortage of gunpowder, plastic explosives, and TNT, the Financial Times reported.\n\nDefense Minister Oleksii Reznikov appealed to the EU on March 3 to provide Ukraine with 250,000 artillery shells a month to ease a critical shortage that limits the country's progress on the battlefield."
  },
  {
    "date": "2023-03-19 12:20:16",
    "text": "[**Estonian Defense Minister: 'Russian army has not changed in 100 years'](https://kyivindependent.com/regional/estonian-defense-minister-its-still-an-artillery-fight-and-tallinn-will-help-kyiv-get-at-least-1-million-rounds)****\n**\nIn an exclusive interview with the Kyiv Independent, Estonian Defense Minister Hanno Pevkur explains how Estonia is training Ukrainian soldiers. “We are doing three companies and altogether 600 infantry basic training,” says Pevkur.\n\n[**Read the full interview](https://kyivindependent.com/regional/estonian-defense-minister-its-still-an-artillery-fight-and-tallinn-will-help-kyiv-get-at-least-1-million-rounds)**"
  },
  {
    "date": "2023-03-19 12:13:11",
    "text": "⚡️**Official: Court **[**sentences](https://kyivindependent.com/news-feed/official-ukraine-sentences-russian-proxy-leader-in-absentia-to-15-years)**** Russian proxy in absentia to 15 years in jail. **\n\nA Zaporizhzhia court has sentenced Oleksandr Saulenko, head of the illegal Russian occupation administration in the town of Berdiansk in Zaporizhzhia Oblast, in absentia to 15 years in jail with the confiscation of property, Melitopol Mayor Ivan Fedorov said on March 19."
  },
  {
    "date": "2023-03-19 11:16:43",
    "text": "⚡️**UK Defense Ministry: Russia tacitly **[**acknowledges](https://kyivindependent.com/news-feed/uk-defense-ministry-russia-tacitly-acknowledges-its-forces-are-highly-unlikely-to-seize-zaporizhzhia)**** its forces are unlikely to seize Zaporizhzhia. **\n\nRussia's decision to make Melitopol the \"temporary\" capital of the illegal occupation administration in Ukraine's Zaporizhzhia Oblast may indicate that Russian forces are highly unlikely to seize planned major objectives, including the city of Zaporizhzhia, in the near future, the U.K. Defense Ministry said in its daily update on March 19."
  }
]